Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 960)]        0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 201)]        0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 400)]        0                                            
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 960)          3840        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 201)          804         input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 400)          1600        input_3[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 300)          288300      batch_normalization[0][0]        
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 200)          40400       batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 400)          160400      batch_normalization_2[0][0]      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 300)          0           dense[0][0]                      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 200)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 400)          0           dense_4[0][0]                    
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 27)]         0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 300)          90300       dropout[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 200)          40200       dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 400)          160400      dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 27)           108         input_4[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 927)          0           dense_1[0][0]                    
                                                                 dense_3[0][0]                    
                                                                 dense_5[0][0]                    
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 927)          3708        concatenate[0][0]                
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 500)          464000      batch_normalization_4[0][0]      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 500)          0           dense_6[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 500)          250500      dropout_3[0][0]                  
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 78)           39078       dense_7[0][0]                    
==================================================================================================
Total params: 1,543,638
Trainable params: 1,538,608
Non-trainable params: 5,030
__________________________________________________________________________________________________